# Plant_ReplacePlantParam

## Description
Replaces plant parameters using information from replacement plant object.

```pascal
FUNCTION Plant_ReplacePlantParam(origPlantObj : HANDLE): HANDLE;
```

```python
def vs.Plant_ReplacePlantParam(origPlantObj):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|origPlantObj|HANDLE|   |

## Version
Availability: from Vectorworks 2014

## Category
* PlantObjectCoreTools